OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f767.h
#define _FOSC_LP                0x3FEC  // LP oscillator.
#define _LP_OSC                 0x3FEC  // LP oscillator.
#define _FOSC_XT                0x3FED  // XT oscillator.
#define _XT_OSC                 0x3FED  // XT oscillator.
#define _FOSC_HS                0x3FEE  // HS oscillator.
#define _HS_OSC                 0x3FEE  // HS oscillator.
#define _FOSC_EC                0x3FEF  // EXTCLK; port I/O function on OSC2/CLKO/RA6.
#define _EXTCLK                 0x3FEF  // EXTCLK; port I/O function on OSC2/CLKO/RA6.
#define _FOSC_INTOSCIO          0x3FFC  // INTRC oscillator; port I/O function on OSC1/CLKI/RA7 and OSC2/CLKO/RA6.
#define _INTRC_IO               0x3FFC  // INTRC oscillator; port I/O function on OSC1/CLKI/RA7 and OSC2/CLKO/RA6.
#define _FOSC_INTOSCCLK         0x3FFD  // INTRC oscillator; CLKO function on OSC2/CLKO/RA6 and port I/O function on OSC1/CLKI/RA7.
#define _INTRC_CLKOUT           0x3FFD  // INTRC oscillator; CLKO function on OSC2/CLKO/RA6 and port I/O function on OSC1/CLKI/RA7.
#define _FOSC_EXTRCIO           0x3FFE  // EXTRC oscillator; port I/O function on OSC2/CLKO/RA6.
#define _EXTRC_IO               0x3FFE  // EXTRC oscillator; port I/O function on OSC2/CLKO/RA6.
#define _FOSC_EXTRCCLK          0x3FFF  // EXTRC oscillator; CLKO function on OSC2/CLKO/RA6.
#define _EXTRC_CLKOUT           0x3FFF  // EXTRC oscillator; CLKO function on OSC2/CLKO/RA6.
#define _WDTE_OFF               0x3FFB  // WDT disabled.
#define _WDT_OFF                0x3FFB  // WDT disabled.
#define _WDTE_ON                0x3FFF  // WDT enabled.
#define _WDT_ON                 0x3FFF  // WDT enabled.
#define _PWRTE_ON               0x3FF7  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _MCLRE_OFF              0x3FDF  // MCLR/VPP/RE3 pin function is digital input only, MCLR gated to '1'.
#define _MCLR_OFF               0x3FDF  // MCLR/VPP/RE3 pin function is digital input only, MCLR gated to '1'.
#define _MCLRE_ON               0x3FFF  // MCLR/VPP/RE3 pin function is MCLR.
#define _MCLR_ON                0x3FFF  // MCLR/VPP/RE3 pin function is MCLR.
#define _BOREN_OFF              0x3FBF  // Disabled.
#define _BOREN_0                0x3FBF  // Disabled.
#define _BOREN_ON               0x3FFF  // Enabled.
#define _BOREN_1                0x3FFF  // Enabled.
#define _BORV_45                0x3E7F  // VBOR set to 4.5V.
#define _VBOR_4_5               0x3E7F  // VBOR set to 4.5V.
#define _BORV_42                0x3EFF  // VBOR set to 4.2V.
#define _VBOR_4_2               0x3EFF  // VBOR set to 4.2V.
#define _BORV_27                0x3F7F  // VBOR set to 2.7V.
#define _VBOR_2_7               0x3F7F  // VBOR set to 2.7V.
#define _BORV_20                0x3FFF  // VBOR set to 2.0V.
#define _VBOR_2_0               0x3FFF  // VBOR set to 2.0V.
#define _DEBUG_ON               0x37FF  // In-Circuit Debugger enabled, RB6 and RB7 are dedicated to the debugger.
#define _DEBUG_OFF              0x3FFF  // In-Circuit Debugger disabled, RB6 and RB7 are general purpose I/O pins.
#define _CCP2MX_RB3             0x2FFF  // CCP2 is on RB3.
#define _CCP2_RB3               0x2FFF  // CCP2 is on RB3.
#define _CCP2MX_RC1             0x3FFF  // CCP2 is on RC1.
#define _CCP2_RC1               0x3FFF  // CCP2 is on RC1.
#define _CP_ON                  0x1FFF  // 0000h to 1FFFh code-protected.
#define _CP_ALL                 0x1FFF  // 0000h to 1FFFh code-protected.
#define _CP_OFF                 0x3FFF  // Code protection off.

//----------------------------- CONFIG2 Options -------------------------------

#define _FCMEN_OFF              0x3FFE  // Fail-Safe Clock Monitor disabled.
#define _FCMEN_ON               0x3FFF  // Fail-Safe Clock Monitor enabled.
#define _IESO_OFF               0x3FFD  // Internal External Switchover mode disabled.
#define _IESO_ON                0x3FFF  // Internal External Switchover mode enabled.
#define _BORSEN_OFF             0x3FBF  // Disabled.
#define _BORSEN_0               0x3FBF  // Disabled.
#define _BORSEN_ON              0x3FFF  // Enabled.
#define _BORSEN_1               0x3FFF  // Enabled.

//==============================================================================

#define _DEVID1                 0x2006

#define _IDLOC0                 0x2000
#define _IDLOC1                 0x2001
#define _IDLOC2                 0x2002
#define _IDLOC3                 0x2003

//==============================================================================

#ifndef NO_BIT_DEFINES

#define ADON                    ADCON0bits.ADON                 // bit 0
#define CHS3                    ADCON0bits.CHS3                 // bit 1
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 2, shadows bit in ADCON0bits
#define GO                      ADCON0bits.GO                   // bit 2, shadows bit in ADCON0bits
#define NOT_DONE                ADCON0bits.NOT_DONE             // bit 2, shadows bit in ADCON0bits
#define GO_DONE                 ADCON0bits.GO_DONE              // bit 2, shadows bit in ADCON0bits
#define CHS0                    ADCON0bits.CHS0                 // bit 3
#define CHS1                    ADCON0bits.CHS1                 // bit 4
#define CHS2                    ADCON0bits.CHS2                 // bit 5
#define ADCS0                   ADCON0bits.ADCS0                // bit 6
#define ADCS1                   ADCON0bits.ADCS1                // bit 7

#define PCFG0                   ADCON1bits.PCFG0                // bit 0
#define PCFG1                   ADCON1bits.PCFG1                // bit 1
#define PCFG2                   ADCON1bits.PCFG2                // bit 2
#define PCFG3                   ADCON1bits.PCFG3                // bit 3
#define VCFG0                   ADCON1bits.VCFG0                // bit 4
#define VCFG1                   ADCON1bits.VCFG1                // bit 5
#define ADCS2                   ADCON1bits.ADCS2                // bit 6
#define ADFM                    ADCON1bits.ADFM                 // bit 7

#define ACQT0                   ADCON2bits.ACQT0                // bit 3
#define ACQT1                   ADCON2bits.ACQT1                // bit 4
#define ACQT2                   ADCON2bits.ACQT2                // bit 5

#define CCP1M0                  CCP1CONbits.CCP1M0              // bit 0
#define CCP1M1                  CCP1CONbits.CCP1M1              // bit 1
#define CCP1M2                  CCP1CONbits.CCP1M2              // bit 2
#define CCP1M3                  CCP1CONbits.CCP1M3              // bit 3
#define CCP1Y                   CCP1CONbits.CCP1Y               // bit 4
#define CCP1X                   CCP1CONbits.CCP1X               // bit 5

#define CCP2M0                  CCP2CONbits.CCP2M0              // bit 0
#define CCP2M1                  CCP2CONbits.CCP2M1              // bit 1
#define CCP2M2                  CCP2CONbits.CCP2M2              // bit 2
#define CCP2M3                  CCP2CONbits.CCP2M3              // bit 3
#define CCP2Y                   CCP2CONbits.CCP2Y               // bit 4
#define CCP2X                   CCP2CONbits.CCP2X               // bit 5

#define CCP3M0                  CCP3CONbits.CCP3M0              // bit 0
#define CCP3M1                  CCP3CONbits.CCP3M1              // bit 1
#define CCP3M2                  CCP3CONbits.CCP3M2              // bit 2
#define CCP3M3                  CCP3CONbits.CCP3M3              // bit 3
#define CCP3Y                   CCP3CONbits.CCP3Y               // bit 4
#define CCP3X                   CCP3CONbits.CCP3X               // bit 5

